IDENTIFICATION DIVISION.
    PROGRAM-ID. Aaah.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 HIS-AAAH PIC X(1000).
        01 DOC-AAAH PIC X(1000).
        01 HIS-TOTAL PIC 999.
        01 DOC-TOTAL PIC 999.

PROCEDURE DIVISION.
    ACCEPT HIS-AAAH
    ACCEPT DOC-AAAH
    INSPECT HIS-AAAH TALLYING HIS-TOTAL FOR ALL "a"
    INSPECT DOC-AAAH TALLYING DOC-TOTAL FOR ALL "a"
    IF HIS-TOTAL IS GREATER THAN OR EQUAL TO DOC-TOTAL
        DISPLAY "go"
    ELSE
        DISPLAY "no"
    END-IF
    STOP RUN.