IDENTIFICATION DIVISION.
    PROGRAM-ID. AnotherCandies.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 LOOP-NUMBER PIC 999.
        01 NULL-INPUT PIC X.
        01 NUM-OF-KIDS PIC 9(5).
        01 CANDIES PIC 9(32).
        01 TOTAL PIC 9(32).
        01 REMAIN PIC 9(32).

PROCEDURE DIVISION.
    ACCEPT LOOP-NUMBER
    PERFORM LOOP-NUMBER TIMES
        ACCEPT NULL-INPUT
        ACCEPT NUM-OF-KIDS
        PERFORM NUM-OF-KIDS TIMES
            ACCEPT CANDIES
            ADD CANDIES TO TOTAL
        END-PERFORM
        DIVIDE TOTAL BY NUM-OF-KIDS GIVING TOTAL REMAINDER REMAIN
        IF REMAIN IS EQUAL TO ZERO
            DISPLAY "YES"
        ELSE
            DISPLAY "NO"
        END-IF
        MOVE ZEROS TO TOTAL
    END-PERFORM
    STOP RUN.