IDENTIFICATION DIVISION.
    PROGRAM-ID. SovlingForCarrots.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(9).
        01 N PIC 9(4).
        01 P PIC 9(4).
        01 FORMATTED-OUTPUT PIC ZZZ9.

PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO N, P
    MOVE P TO FORMATTED-OUTPUT
    DISPLAY FORMATTED-OUTPUT
    STOP RUN.