IDENTIFICATION DIVISION.
    PROGRAM-ID. ColdputerScience.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 NUM-OF-TEMPS PIC 999.
        01 TEMPERATURES PIC X(2000).
        01 ANS PIC ZZ9.

PROCEDURE DIVISION.
    ACCEPT NUM-OF-TEMPS
    ACCEPT TEMPERATURES
    MOVE ZEROS TO NUM-OF-TEMPS
    INSPECT TEMPERATURES TALLYING NUM-OF-TEMPS FOR ALL "-"
    MOVE NUM-OF-TEMPS TO ANS
    DISPLAY ANS
    STOP RUN.