IDENTIFICATION DIVISION.
    PROGRAM-ID. DeathKnightHero.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 BATTLES PIC 999.
        01 LOSSES PIC 999.
        01 MOVES PIC X(1000).
        01 CHAINS-DEATH PIC 999.
            88 LOST VALUE 1 THRU 999.
        01 ANSWER PIC ZZ9.
        
PROCEDURE DIVISION.
    ACCEPT BATTLES
    PERFORM BATTLES TIMES
        ACCEPT MOVES
        INITIALIZE CHAINS-DEATH
        INSPECT MOVES TALLYING CHAINS-DEATH FOR ALL "CD"
        IF LOST
            ADD 1 TO LOSSES
        END-IF
    END-PERFORM
    SUBTRACT LOSSES FROM BATTLES GIVING ANSWER
    DISPLAY ANSWER
    STOP RUN.