IDENTIFICATION DIVISION.
    PROGRAM-ID. Filip.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(20).
        01 NUM1 PIC 999.
        01 NUM2 PIC 999.

PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO NUM1, NUM2
    MOVE FUNCTION REVERSE(NUM1) TO NUM1
    MOVE FUNCTION REVERSE(NUM2) TO NUM2
    IF NUM1 GREATER THAN NUM2
        DISPLAY NUM1
    ELSE
        DISPLAY NUM2
    END-IF
    STOP RUN.