IDENTIFICATION DIVISION.
    PROGRAM-ID. GrassSeedInc.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 RAW-INPUT PIC X(50).
        01 COST-PER-SQUARE-FOOT PIC 999V9(8).
        01 LAWNS PIC 999.
        01 LAWN-WIDTH PIC 999V9(8).
        01 LAWN-LENGTH PIC 999V9(8).
        01 TOTAL-COST PIC 9(15)V9(8) VALUE ZERO.

PROCEDURE DIVISION.
    ACCEPT COST-PER-SQUARE-FOOT
    ACCEPT LAWNS
    PERFORM LAWNS TIMES
        ACCEPT RAW-INPUT
        UNSTRING RAW-INPUT DELIMITED BY SPACE INTO LAWN-WIDTH, LAWN-LENGTH
        COMPUTE TOTAL-COST = TOTAL-COST + COST-PER-SQUARE-FOOT * LAWN-WIDTH 
            * LAWN-LENGTH
    END-PERFORM
    DISPLAY TOTAL-COST
    STOP RUN.