IDENTIFICATION DIVISION.
    PROGRAM-ID. HangingOutOnTheTerrace.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(20).
        01 MAX-CAPACITY PIC 999.
        01 EVENTS PIC 999.
        01 DIRECTION PIC X(5).
        01 PEOPLE PIC 999.
        01 TOTAL PIC 9(5) VALUE ZEROS.
        01 REJECTED PIC 9(5) VALUE ZEROS.
        01 FORMATTED-OUTPUT PIC Z(4)9.

PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO MAX-CAPACITY, EVENTS
    PERFORM EVENTS TIMES
        ACCEPT INP
        UNSTRING INP DELIMITED BY SPACE INTO DIRECTION, PEOPLE
        IF DIRECTION EQUAL "enter"
            ADD PEOPLE TO TOTAL
        ELSE
            SUBTRACT PEOPLE FROM TOTAL
        END-IF
        IF TOTAL IS GREATER THAN MAX-CAPACITY
            ADD 1 TO REJECTED
            SUBTRACT PEOPLE FROM TOTAL
        END-IF
    END-PERFORM
    MOVE REJECTED TO FORMATTED-OUTPUT
    DISPLAY FORMATTED-OUTPUT
    STOP RUN.