IDENTIFICATION DIVISION.
    PROGRAM-ID. IsItHalloween.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(10).
        01 MNTH PIC XXX.
        01 DY PIC 99.

PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO MNTH, DY
    IF MNTH EQUALS "OCT" AND DY EQUALS 31 OR MNTH EQUALS "DEC" AND DY EQUALS 25
        DISPLAY "yup"
    ELSE
        DISPLAY "nope"
    END-IF
    STOP RUN.