IDENTIFICATION DIVISION.
    PROGRAM-ID. JustAMinute.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(7).
        01 OBSERVATIONS PIC 9(4).
        01 M PIC 99.
        01 S PIC 9(4).
        01 EXPECTED PIC 9(10).
        01 REAL PIC 9(10).
        01 ANSWER PIC 9(6)V9(10).
        
PROCEDURE DIVISION.
    ACCEPT OBSERVATIONS
    PERFORM OBSERVATIONS TIMES
        ACCEPT INP
        UNSTRING INP DELIMITED BY SPACE INTO M S
        ADD M TO EXPECTED
        ADD S TO REAL
    END-PERFORM
    COMPUTE ANSWER = REAL / (EXPECTED * +60)
    IF ANSWER IS LESS THAN OR EQUAL TO +1
        DISPLAY "measurement error"
    ELSE
        DISPLAY ANSWER
    END-IF
    STOP RUN.