IDENTIFICATION DIVISION.
    PROGRAM-ID. PaulEigon.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(50).
        01 SERVES PIC 9(10).
        01 SCORE1 PIC 9(10).
        01 SCORE2 PIC 9(10).
        
PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO SERVES SCORE1 SCORE2
    ADD SCORE2 TO SCORE1
    DIVIDE SCORE1 BY SERVES GIVING SCORE1
    IF FUNCTION MOD(SCORE1 2) EQUALS ZERO
        DISPLAY "paul"
    ELSE
        DISPLAY "opponent"
    END-IF
    STOP RUN.