IDENTIFICATION DIVISION.
    PROGRAM-ID. RoamingRomans.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 MILES PIC 9(4)V999.
        01 ROMAN PIC Z(6)9.

PROCEDURE DIVISION.
    ACCEPT MILES
    COMPUTE ROMAN ROUNDED = MILES * 1000 * (5280 / 4854)
    DISPLAY ROMAN
    STOP RUN.