IDENTIFICATION DIVISION.
    PROGRAM-ID. SevenWonders.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(50).
        01 T PIC 99 VALUE ZERO.
        01 C PIC 99 VALUE ZERO.
        01 G PIC 99 VALUE ZERO.
        01 MINIMUM PIC 99.
        01 OUT PIC Z(4)9.

PROCEDURE DIVISION.
    ACCEPT INP
    INSPECT INP TALLYING T FOR ALL "T"
    INSPECT INP TALLYING C FOR ALL "C"
    INSPECT INP TALLYING G FOR ALL "G"
    IF T IS LESS THAN OR EQUAL TO C AND G
        MOVE T TO MINIMUM
    END-IF
    IF C IS LESS THAN OR EQUAL TO T AND G
        MOVE C TO MINIMUM
    END-IF
    IF G IS LESS THAN OR EQUAL TO C AND T
        MOVE G TO MINIMUM
    END-IF
    COMPUTE OUT = (T ** 2) + (C ** 2) + (G ** 2) + (MINIMUM * 7)
    DISPLAY OUT
    STOP RUN.