IDENTIFICATION DIVISION.
    PROGRAM-ID. SimonSays.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 LOOP-NUMBER PIC 99.
        01 PHRASE PIC X(1000).

PROCEDURE DIVISION.
    ACCEPT LOOP-NUMBER
    PERFORM LOOP-NUMBER TIMES
        ACCEPT PHRASE
        IF PHRASE(1:10) IS EQUAL TO "simon says"
            DISPLAY PHRASE(12:)
        ELSE
            DISPLAY SPACE
        END-IF
    END-PERFORM
    STOP RUN.