IDENTIFICATION DIVISION.
    PROGRAM-ID. Sjecista.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 SIDES PIC 999.
        01 ANSWER PIC Z(6)9.
        
PROCEDURE DIVISION.
    ACCEPT SIDES
    COMPUTE ANSWER = (SIDES * (SIDES - +1) * (SIDES - +2) * (SIDES - +3)) / +24
    DISPLAY ANSWER
    STOP RUN.