IDENTIFICATION DIVISION.
    PROGRAM-ID. SodaSluper.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(12).
        01 NUM-OF-SODAS1 PIC 9(4).
        01 NUM-OF-SODAS2 PIC 9(4).
        01 COST PIC 9(4).
        01 TOTAL PIC 9(5) VALUE ZEROS.
        01 TEMP PIC 9(4).
        01 ANSWER PIC Z(4)9.

PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO NUM-OF-SODAS1, NUM-OF-SODAS2, COST
    ADD NUM-OF-SODAS2 TO NUM-OF-SODAS1
    PERFORM UNTIL NUM-OF-SODAS1 IS LESS THAN COST
        DIVIDE NUM-OF-SODAS1 BY COST GIVING TEMP
        ADD TEMP TO TOTAL
        ADD TEMP TO FUNCTION MOD(NUM-OF-SODAS1 COST) GIVING NUM-OF-SODAS1
    END-PERFORM
    MOVE TOTAL TO ANSWER
    DISPLAY ANSWER
    STOP RUN.