IDENTIFICATION DIVISION.
    PROGRAM-ID. Sok.
    AUTHOR. Brandon Mitchell.
    
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 INP PIC X(11).
        01 J1 PIC 999.
        01 J2 PIC 999.
        01 J3 PIC 999.
        01 R1 PIC 99.
        01 R2 PIC 99.
        01 R3 PIC 99.
        01 RATIO PIC 9(4)V9(10).
        01 ANS1 PIC 9(4)V9(10).
        01 ANS2 PIC 9(4)V9(10).
        01 ANS3 PIC 9(4)V9(10).
        
PROCEDURE DIVISION.
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO J1, J2, J3
    ACCEPT INP
    UNSTRING INP DELIMITED BY SPACE INTO R1, R2, R3
    MOVE FUNCTION MIN((J1 / R1) (J2 / R2) (J3 / R3)) TO RATIO
    COMPUTE ANS1 = J1 - RATIO * R1
    COMPUTE ANS2 = J2 - RATIO * R2
    COMPUTE ANS3 = J3 - RATIO * R3
    DISPLAY ANS1 SPACE ANS2 SPACE ANS3
    STOP RUN.